program(1.0)
[buildInfo = dict<tensor<string, []>, tensor<string, []>>({{"coremlc-component-MIL", "5.33.5"}, {"coremlc-version", "1877.40.3"}})]
{
    func main<ios16>(tensor<fp32, [1, 3, 480, 480]> image) {
            tensor<fp32, []> image__scaled___y_0 = const()[name = tensor<string, []>("image__scaled___y_0"), val = tensor<fp32, []>(0x1.010102p-8)];
            tensor<fp32, [1, 3, 480, 480]> image__scaled__ = mul(x = image, y = image__scaled___y_0)[name = tensor<string, []>("image__scaled__")];
            tensor<int32, []> var_19 = const()[name = tensor<string, []>("op_19"), val = tensor<int32, []>(1)];
            tensor<int32, []> var_20 = const()[name = tensor<string, []>("op_20"), val = tensor<int32, []>(2)];
            tensor<int32, [2]> var_58 = const()[name = tensor<string, []>("op_58"), val = tensor<int32, [2]>([2, 2])];
            tensor<int32, [2]> var_60 = const()[name = tensor<string, []>("op_60"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_1_pad_type_0 = const()[name = tensor<string, []>("input_1_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_1_pad_0 = const()[name = tensor<string, []>("input_1_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<string, []> image_to_fp16_dtype_0 = const()[name = tensor<string, []>("image_to_fp16_dtype_0"), val = tensor<string, []>("fp16")];
            tensor<fp16, [32, 3, 3, 3]> model_model_0_conv_weight_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [864]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(64))), lut = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1024))), name = tensor<string, []>("model_model_0_conv_weight_to_fp16_palettized"), shape = tensor<uint32, [4]>([32, 3, 3, 3])];
            tensor<fp16, [32]> model_model_0_conv_bias_to_fp16 = const()[name = tensor<string, []>("model_model_0_conv_bias_to_fp16"), val = tensor<fp16, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1600)))];
            tensor<fp16, [1, 3, 480, 480]> cast_2 = cast(dtype = image_to_fp16_dtype_0, x = image__scaled__)[name = tensor<string, []>("cast_2")];
            tensor<fp16, [1, 32, 240, 240]> input_1_cast = conv(bias = model_model_0_conv_bias_to_fp16, dilations = var_60, groups = var_19, pad = input_1_pad_0, pad_type = input_1_pad_type_0, strides = var_58, weight = model_model_0_conv_weight_to_fp16_palettized, x = cast_2)[name = tensor<string, []>("input_1_cast")];
            tensor<fp16, [1, 32, 240, 240]> input_3_cast = silu(x = input_1_cast)[name = tensor<string, []>("input_3_cast")];
            tensor<int32, [2]> var_67 = const()[name = tensor<string, []>("op_67"), val = tensor<int32, [2]>([2, 2])];
            tensor<int32, [2]> var_69 = const()[name = tensor<string, []>("op_69"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_5_pad_type_0 = const()[name = tensor<string, []>("input_5_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_5_pad_0 = const()[name = tensor<string, []>("input_5_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<fp16, [64, 32, 3, 3]> model_model_1_conv_weight_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [18432]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1728))), lut = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(20224))), name = tensor<string, []>("model_model_1_conv_weight_to_fp16_palettized"), shape = tensor<uint32, [4]>([64, 32, 3, 3])];
            tensor<fp16, [64]> model_model_1_conv_bias_to_fp16 = const()[name = tensor<string, []>("model_model_1_conv_bias_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(20800)))];
            tensor<fp16, [1, 64, 120, 120]> input_5_cast = conv(bias = model_model_1_conv_bias_to_fp16, dilations = var_69, groups = var_19, pad = input_5_pad_0, pad_type = input_5_pad_type_0, strides = var_67, weight = model_model_1_conv_weight_to_fp16_palettized, x = input_3_cast)[name = tensor<string, []>("input_5_cast")];
            tensor<fp16, [1, 64, 120, 120]> input_7_cast = silu(x = input_5_cast)[name = tensor<string, []>("input_7_cast")];
            tensor<int32, [2]> var_80 = const()[name = tensor<string, []>("op_80"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_82 = const()[name = tensor<string, []>("op_82"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_9_pad_type_0 = const()[name = tensor<string, []>("input_9_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_9_pad_0 = const()[name = tensor<string, []>("input_9_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [64, 64, 1, 1]> model_model_2_cv1_conv_weight_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [4096]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(20992))), lut = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(25152))), name = tensor<string, []>("model_model_2_cv1_conv_weight_to_fp16_palettized"), shape = tensor<uint32, [4]>([64, 64, 1, 1])];
            tensor<fp16, [64]> model_model_2_cv1_conv_bias_to_fp16 = const()[name = tensor<string, []>("model_model_2_cv1_conv_bias_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(25728)))];
            tensor<fp16, [1, 64, 120, 120]> input_9_cast = conv(bias = model_model_2_cv1_conv_bias_to_fp16, dilations = var_82, groups = var_19, pad = input_9_pad_0, pad_type = input_9_pad_type_0, strides = var_80, weight = model_model_2_cv1_conv_weight_to_fp16_palettized, x = input_7_cast)[name = tensor<string, []>("input_9_cast")];
            tensor<fp16, [1, 64, 120, 120]> var_85_cast = silu(x = input_9_cast)[name = tensor<string, []>("op_85_cast")];
            tensor<int32, [2]> var_86 = const()[name = tensor<string, []>("op_86"), val = tensor<int32, [2]>([32, 32])];
            tensor<int32, []> var_87_axis_0 = const()[name = tensor<string, []>("op_87_axis_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [1, 32, 120, 120]> var_87_cast_0, tensor<fp16, [1, 32, 120, 120]> var_87_cast_1 = split(axis = var_87_axis_0, split_sizes = var_86, x = var_85_cast)[name = tensor<string, []>("op_87_cast")];
            tensor<int32, [2]> var_95 = const()[name = tensor<string, []>("op_95"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_97 = const()[name = tensor<string, []>("op_97"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_13_pad_type_0 = const()[name = tensor<string, []>("input_13_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_13_pad_0 = const()[name = tensor<string, []>("input_13_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<fp16, [32, 32, 3, 3]> model_model_2_m_0_cv1_conv_weight_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [9216]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(25920))), lut = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(35200))), name = tensor<string, []>("model_model_2_m_0_cv1_conv_weight_to_fp16_palettized"), shape = tensor<uint32, [4]>([32, 32, 3, 3])];
            tensor<fp16, [32]> model_model_2_m_0_cv1_conv_bias_to_fp16 = const()[name = tensor<string, []>("model_model_2_m_0_cv1_conv_bias_to_fp16"), val = tensor<fp16, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(35776)))];
            tensor<fp16, [1, 32, 120, 120]> input_13_cast = conv(bias = model_model_2_m_0_cv1_conv_bias_to_fp16, dilations = var_97, groups = var_19, pad = input_13_pad_0, pad_type = input_13_pad_type_0, strides = var_95, weight = model_model_2_m_0_cv1_conv_weight_to_fp16_palettized, x = var_87_cast_1)[name = tensor<string, []>("input_13_cast")];
            tensor<fp16, [1, 32, 120, 120]> input_15_cast = silu(x = input_13_cast)[name = tensor<string, []>("input_15_cast")];
            tensor<int32, [2]> var_104 = const()[name = tensor<string, []>("op_104"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_106 = const()[name = tensor<string, []>("op_106"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_17_pad_type_0 = const()[name = tensor<string, []>("input_17_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_17_pad_0 = const()[name = tensor<string, []>("input_17_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<fp16, [32, 32, 3, 3]> model_model_2_m_0_cv2_conv_weight_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [9216]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(35904))), lut = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(45184))), name = tensor<string, []>("model_model_2_m_0_cv2_conv_weight_to_fp16_palettized"), shape = tensor<uint32, [4]>([32, 32, 3, 3])];
            tensor<fp16, [32]> model_model_2_m_0_cv2_conv_bias_to_fp16 = const()[name = tensor<string, []>("model_model_2_m_0_cv2_conv_bias_to_fp16"), val = tensor<fp16, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(45760)))];
            tensor<fp16, [1, 32, 120, 120]> input_17_cast = conv(bias = model_model_2_m_0_cv2_conv_bias_to_fp16, dilations = var_106, groups = var_19, pad = input_17_pad_0, pad_type = input_17_pad_type_0, strides = var_104, weight = model_model_2_m_0_cv2_conv_weight_to_fp16_palettized, x = input_15_cast)[name = tensor<string, []>("input_17_cast")];
            tensor<fp16, [1, 32, 120, 120]> var_109_cast = silu(x = input_17_cast)[name = tensor<string, []>("op_109_cast")];
            tensor<fp16, [1, 32, 120, 120]> var_110_cast = add(x = var_87_cast_1, y = var_109_cast)[name = tensor<string, []>("op_110_cast")];
            tensor<bool, []> input_19_interleave_0 = const()[name = tensor<string, []>("input_19_interleave_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 96, 120, 120]> input_19_cast = concat(axis = var_19, interleave = input_19_interleave_0, values = (var_87_cast_0, var_87_cast_1, var_110_cast))[name = tensor<string, []>("input_19_cast")];
            tensor<int32, [2]> var_116 = const()[name = tensor<string, []>("op_116"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_118 = const()[name = tensor<string, []>("op_118"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_21_pad_type_0 = const()[name = tensor<string, []>("input_21_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_21_pad_0 = const()[name = tensor<string, []>("input_21_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [64, 96, 1, 1]> model_model_2_cv2_conv_weight_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [6144]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(45888))), lut = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(52096))), name = tensor<string, []>("model_model_2_cv2_conv_weight_to_fp16_palettized"), shape = tensor<uint32, [4]>([64, 96, 1, 1])];
            tensor<fp16, [64]> model_model_2_cv2_conv_bias_to_fp16 = const()[name = tensor<string, []>("model_model_2_cv2_conv_bias_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(52672)))];
            tensor<fp16, [1, 64, 120, 120]> input_21_cast = conv(bias = model_model_2_cv2_conv_bias_to_fp16, dilations = var_118, groups = var_19, pad = input_21_pad_0, pad_type = input_21_pad_type_0, strides = var_116, weight = model_model_2_cv2_conv_weight_to_fp16_palettized, x = input_19_cast)[name = tensor<string, []>("input_21_cast")];
            tensor<fp16, [1, 64, 120, 120]> input_23_cast = silu(x = input_21_cast)[name = tensor<string, []>("input_23_cast")];
            tensor<int32, [2]> var_125 = const()[name = tensor<string, []>("op_125"), val = tensor<int32, [2]>([2, 2])];
            tensor<int32, [2]> var_127 = const()[name = tensor<string, []>("op_127"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_25_pad_type_0 = const()[name = tensor<string, []>("input_25_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_25_pad_0 = const()[name = tensor<string, []>("input_25_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<fp16, [128, 64, 3, 3]> model_model_3_conv_weight_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [73728]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(52864))), lut = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(126656))), name = tensor<string, []>("model_model_3_conv_weight_to_fp16_palettized"), shape = tensor<uint32, [4]>([128, 64, 3, 3])];
            tensor<fp16, [128]> model_model_3_conv_bias_to_fp16 = const()[name = tensor<string, []>("model_model_3_conv_bias_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(127232)))];
            tensor<fp16, [1, 128, 60, 60]> input_25_cast = conv(bias = model_model_3_conv_bias_to_fp16, dilations = var_127, groups = var_19, pad = input_25_pad_0, pad_type = input_25_pad_type_0, strides = var_125, weight = model_model_3_conv_weight_to_fp16_palettized, x = input_23_cast)[name = tensor<string, []>("input_25_cast")];
            tensor<fp16, [1, 128, 60, 60]> input_27_cast = silu(x = input_25_cast)[name = tensor<string, []>("input_27_cast")];
            tensor<int32, [2]> var_140 = const()[name = tensor<string, []>("op_140"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_142 = const()[name = tensor<string, []>("op_142"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_29_pad_type_0 = const()[name = tensor<string, []>("input_29_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_29_pad_0 = const()[name = tensor<string, []>("input_29_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [128, 128, 1, 1]> model_model_4_cv1_conv_weight_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [16384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(127552))), lut = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(144000))), name = tensor<string, []>("model_model_4_cv1_conv_weight_to_fp16_palettized"), shape = tensor<uint32, [4]>([128, 128, 1, 1])];
            tensor<fp16, [128]> model_model_4_cv1_conv_bias_to_fp16 = const()[name = tensor<string, []>("model_model_4_cv1_conv_bias_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(144576)))];
            tensor<fp16, [1, 128, 60, 60]> input_29_cast = conv(bias = model_model_4_cv1_conv_bias_to_fp16, dilations = var_142, groups = var_19, pad = input_29_pad_0, pad_type = input_29_pad_type_0, strides = var_140, weight = model_model_4_cv1_conv_weight_to_fp16_palettized, x = input_27_cast)[name = tensor<string, []>("input_29_cast")];
            tensor<fp16, [1, 128, 60, 60]> var_145_cast = silu(x = input_29_cast)[name = tensor<string, []>("op_145_cast")];
            tensor<int32, [2]> var_146 = const()[name = tensor<string, []>("op_146"), val = tensor<int32, [2]>([64, 64])];
            tensor<int32, []> var_147_axis_0 = const()[name = tensor<string, []>("op_147_axis_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [1, 64, 60, 60]> var_147_cast_0, tensor<fp16, [1, 64, 60, 60]> var_147_cast_1 = split(axis = var_147_axis_0, split_sizes = var_146, x = var_145_cast)[name = tensor<string, []>("op_147_cast")];
            tensor<int32, [2]> var_155 = const()[name = tensor<string, []>("op_155"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_157 = const()[name = tensor<string, []>("op_157"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_33_pad_type_0 = const()[name = tensor<string, []>("input_33_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_33_pad_0 = const()[name = tensor<string, []>("input_33_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<fp16, [64, 64, 3, 3]> model_model_4_m_0_cv1_conv_weight_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [36864]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(144896))), lut = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(181824))), name = tensor<string, []>("model_model_4_m_0_cv1_conv_weight_to_fp16_palettized"), shape = tensor<uint32, [4]>([64, 64, 3, 3])];
            tensor<fp16, [64]> model_model_4_m_0_cv1_conv_bias_to_fp16 = const()[name = tensor<string, []>("model_model_4_m_0_cv1_conv_bias_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(182400)))];
            tensor<fp16, [1, 64, 60, 60]> input_33_cast = conv(bias = model_model_4_m_0_cv1_conv_bias_to_fp16, dilations = var_157, groups = var_19, pad = input_33_pad_0, pad_type = input_33_pad_type_0, strides = var_155, weight = model_model_4_m_0_cv1_conv_weight_to_fp16_palettized, x = var_147_cast_1)[name = tensor<string, []>("input_33_cast")];
            tensor<fp16, [1, 64, 60, 60]> input_35_cast = silu(x = input_33_cast)[name = tensor<string, []>("input_35_cast")];
            tensor<int32, [2]> var_164 = const()[name = tensor<string, []>("op_164"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_166 = const()[name = tensor<string, []>("op_166"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_37_pad_type_0 = const()[name = tensor<string, []>("input_37_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_37_pad_0 = const()[name = tensor<string, []>("input_37_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<fp16, [64, 64, 3, 3]> model_model_4_m_0_cv2_conv_weight_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [36864]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(182592))), lut = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(219520))), name = tensor<string, []>("model_model_4_m_0_cv2_conv_weight_to_fp16_palettized"), shape = tensor<uint32, [4]>([64, 64, 3, 3])];
            tensor<fp16, [64]> model_model_4_m_0_cv2_conv_bias_to_fp16 = const()[name = tensor<string, []>("model_model_4_m_0_cv2_conv_bias_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(220096)))];
            tensor<fp16, [1, 64, 60, 60]> input_37_cast = conv(bias = model_model_4_m_0_cv2_conv_bias_to_fp16, dilations = var_166, groups = var_19, pad = input_37_pad_0, pad_type = input_37_pad_type_0, strides = var_164, weight = model_model_4_m_0_cv2_conv_weight_to_fp16_palettized, x = input_35_cast)[name = tensor<string, []>("input_37_cast")];
            tensor<fp16, [1, 64, 60, 60]> var_169_cast = silu(x = input_37_cast)[name = tensor<string, []>("op_169_cast")];
            tensor<fp16, [1, 64, 60, 60]> input_39_cast = add(x = var_147_cast_1, y = var_169_cast)[name = tensor<string, []>("input_39_cast")];
            tensor<int32, [2]> var_176 = const()[name = tensor<string, []>("op_176"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_178 = const()[name = tensor<string, []>("op_178"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_41_pad_type_0 = const()[name = tensor<string, []>("input_41_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_41_pad_0 = const()[name = tensor<string, []>("input_41_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<fp16, [64, 64, 3, 3]> model_model_4_m_1_cv1_conv_weight_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [36864]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(220288))), lut = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(257216))), name = tensor<string, []>("model_model_4_m_1_cv1_conv_weight_to_fp16_palettized"), shape = tensor<uint32, [4]>([64, 64, 3, 3])];
            tensor<fp16, [64]> model_model_4_m_1_cv1_conv_bias_to_fp16 = const()[name = tensor<string, []>("model_model_4_m_1_cv1_conv_bias_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(257792)))];
            tensor<fp16, [1, 64, 60, 60]> input_41_cast = conv(bias = model_model_4_m_1_cv1_conv_bias_to_fp16, dilations = var_178, groups = var_19, pad = input_41_pad_0, pad_type = input_41_pad_type_0, strides = var_176, weight = model_model_4_m_1_cv1_conv_weight_to_fp16_palettized, x = input_39_cast)[name = tensor<string, []>("input_41_cast")];
            tensor<fp16, [1, 64, 60, 60]> input_43_cast = silu(x = input_41_cast)[name = tensor<string, []>("input_43_cast")];
            tensor<int32, [2]> var_185 = const()[name = tensor<string, []>("op_185"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_187 = const()[name = tensor<string, []>("op_187"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_45_pad_type_0 = const()[name = tensor<string, []>("input_45_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_45_pad_0 = const()[name = tensor<string, []>("input_45_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<fp16, [64, 64, 3, 3]> model_model_4_m_1_cv2_conv_weight_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [36864]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(257984))), lut = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(294912))), name = tensor<string, []>("model_model_4_m_1_cv2_conv_weight_to_fp16_palettized"), shape = tensor<uint32, [4]>([64, 64, 3, 3])];
            tensor<fp16, [64]> model_model_4_m_1_cv2_conv_bias_to_fp16 = const()[name = tensor<string, []>("model_model_4_m_1_cv2_conv_bias_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(295488)))];
            tensor<fp16, [1, 64, 60, 60]> input_45_cast = conv(bias = model_model_4_m_1_cv2_conv_bias_to_fp16, dilations = var_187, groups = var_19, pad = input_45_pad_0, pad_type = input_45_pad_type_0, strides = var_185, weight = model_model_4_m_1_cv2_conv_weight_to_fp16_palettized, x = input_43_cast)[name = tensor<string, []>("input_45_cast")];
            tensor<fp16, [1, 64, 60, 60]> var_190_cast = silu(x = input_45_cast)[name = tensor<string, []>("op_190_cast")];
            tensor<fp16, [1, 64, 60, 60]> var_191_cast = add(x = input_39_cast, y = var_190_cast)[name = tensor<string, []>("op_191_cast")];
            tensor<bool, []> input_47_interleave_0 = const()[name = tensor<string, []>("input_47_interleave_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 256, 60, 60]> input_47_cast = concat(axis = var_19, interleave = input_47_interleave_0, values = (var_147_cast_0, var_147_cast_1, input_39_cast, var_191_cast))[name = tensor<string, []>("input_47_cast")];
            tensor<int32, [2]> var_197 = const()[name = tensor<string, []>("op_197"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_199 = const()[name = tensor<string, []>("op_199"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_49_pad_type_0 = const()[name = tensor<string, []>("input_49_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_49_pad_0 = const()[name = tensor<string, []>("input_49_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [128, 256, 1, 1]> model_model_4_cv2_conv_weight_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [32768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(295680))), lut = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(328512))), name = tensor<string, []>("model_model_4_cv2_conv_weight_to_fp16_palettized"), shape = tensor<uint32, [4]>([128, 256, 1, 1])];
            tensor<fp16, [128]> model_model_4_cv2_conv_bias_to_fp16 = const()[name = tensor<string, []>("model_model_4_cv2_conv_bias_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(329088)))];
            tensor<fp16, [1, 128, 60, 60]> input_49_cast = conv(bias = model_model_4_cv2_conv_bias_to_fp16, dilations = var_199, groups = var_19, pad = input_49_pad_0, pad_type = input_49_pad_type_0, strides = var_197, weight = model_model_4_cv2_conv_weight_to_fp16_palettized, x = input_47_cast)[name = tensor<string, []>("input_49_cast")];
            tensor<fp16, [1, 128, 60, 60]> input_51_cast = silu(x = input_49_cast)[name = tensor<string, []>("input_51_cast")];
            tensor<int32, [2]> var_206 = const()[name = tensor<string, []>("op_206"), val = tensor<int32, [2]>([2, 2])];
            tensor<int32, [2]> var_208 = const()[name = tensor<string, []>("op_208"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_53_pad_type_0 = const()[name = tensor<string, []>("input_53_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_53_pad_0 = const()[name = tensor<string, []>("input_53_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<fp16, [256, 128, 3, 3]> model_model_5_conv_weight_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [294912]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(329408))), lut = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(624384))), name = tensor<string, []>("model_model_5_conv_weight_to_fp16_palettized"), shape = tensor<uint32, [4]>([256, 128, 3, 3])];
            tensor<fp16, [256]> model_model_5_conv_bias_to_fp16 = const()[name = tensor<string, []>("model_model_5_conv_bias_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(624960)))];
            tensor<fp16, [1, 256, 30, 30]> input_53_cast = conv(bias = model_model_5_conv_bias_to_fp16, dilations = var_208, groups = var_19, pad = input_53_pad_0, pad_type = input_53_pad_type_0, strides = var_206, weight = model_model_5_conv_weight_to_fp16_palettized, x = input_51_cast)[name = tensor<string, []>("input_53_cast")];
            tensor<fp16, [1, 256, 30, 30]> input_55_cast = silu(x = input_53_cast)[name = tensor<string, []>("input_55_cast")];
            tensor<int32, [2]> var_221 = const()[name = tensor<string, []>("op_221"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_223 = const()[name = tensor<string, []>("op_223"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_57_pad_type_0 = const()[name = tensor<string, []>("input_57_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_57_pad_0 = const()[name = tensor<string, []>("input_57_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [256, 256, 1, 1]> model_model_6_cv1_conv_weight_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [65536]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(625536))), lut = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(691136))), name = tensor<string, []>("model_model_6_cv1_conv_weight_to_fp16_palettized"), shape = tensor<uint32, [4]>([256, 256, 1, 1])];
            tensor<fp16, [256]> model_model_6_cv1_conv_bias_to_fp16 = const()[name = tensor<string, []>("model_model_6_cv1_conv_bias_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(691712)))];
            tensor<fp16, [1, 256, 30, 30]> input_57_cast = conv(bias = model_model_6_cv1_conv_bias_to_fp16, dilations = var_223, groups = var_19, pad = input_57_pad_0, pad_type = input_57_pad_type_0, strides = var_221, weight = model_model_6_cv1_conv_weight_to_fp16_palettized, x = input_55_cast)[name = tensor<string, []>("input_57_cast")];
            tensor<fp16, [1, 256, 30, 30]> var_226_cast = silu(x = input_57_cast)[name = tensor<string, []>("op_226_cast")];
            tensor<int32, [2]> var_227 = const()[name = tensor<string, []>("op_227"), val = tensor<int32, [2]>([128, 128])];
            tensor<int32, []> var_228_axis_0 = const()[name = tensor<string, []>("op_228_axis_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [1, 128, 30, 30]> var_228_cast_0, tensor<fp16, [1, 128, 30, 30]> var_228_cast_1 = split(axis = var_228_axis_0, split_sizes = var_227, x = var_226_cast)[name = tensor<string, []>("op_228_cast")];
            tensor<int32, [2]> var_236 = const()[name = tensor<string, []>("op_236"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_238 = const()[name = tensor<string, []>("op_238"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_61_pad_type_0 = const()[name = tensor<string, []>("input_61_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_61_pad_0 = const()[name = tensor<string, []>("input_61_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<fp16, [128, 128, 3, 3]> model_model_6_m_0_cv1_conv_weight_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [147456]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(692288))), lut = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(839808))), name = tensor<string, []>("model_model_6_m_0_cv1_conv_weight_to_fp16_palettized"), shape = tensor<uint32, [4]>([128, 128, 3, 3])];
            tensor<fp16, [128]> model_model_6_m_0_cv1_conv_bias_to_fp16 = const()[name = tensor<string, []>("model_model_6_m_0_cv1_conv_bias_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(840384)))];
            tensor<fp16, [1, 128, 30, 30]> input_61_cast = conv(bias = model_model_6_m_0_cv1_conv_bias_to_fp16, dilations = var_238, groups = var_19, pad = input_61_pad_0, pad_type = input_61_pad_type_0, strides = var_236, weight = model_model_6_m_0_cv1_conv_weight_to_fp16_palettized, x = var_228_cast_1)[name = tensor<string, []>("input_61_cast")];
            tensor<fp16, [1, 128, 30, 30]> input_63_cast = silu(x = input_61_cast)[name = tensor<string, []>("input_63_cast")];
            tensor<int32, [2]> var_245 = const()[name = tensor<string, []>("op_245"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_247 = const()[name = tensor<string, []>("op_247"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_65_pad_type_0 = const()[name = tensor<string, []>("input_65_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_65_pad_0 = const()[name = tensor<string, []>("input_65_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<fp16, [128, 128, 3, 3]> model_model_6_m_0_cv2_conv_weight_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [147456]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(840704))), lut = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(988224))), name = tensor<string, []>("model_model_6_m_0_cv2_conv_weight_to_fp16_palettized"), shape = tensor<uint32, [4]>([128, 128, 3, 3])];
            tensor<fp16, [128]> model_model_6_m_0_cv2_conv_bias_to_fp16 = const()[name = tensor<string, []>("model_model_6_m_0_cv2_conv_bias_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(988800)))];
            tensor<fp16, [1, 128, 30, 30]> input_65_cast = conv(bias = model_model_6_m_0_cv2_conv_bias_to_fp16, dilations = var_247, groups = var_19, pad = input_65_pad_0, pad_type = input_65_pad_type_0, strides = var_245, weight = model_model_6_m_0_cv2_conv_weight_to_fp16_palettized, x = input_63_cast)[name = tensor<string, []>("input_65_cast")];
            tensor<fp16, [1, 128, 30, 30]> var_250_cast = silu(x = input_65_cast)[name = tensor<string, []>("op_250_cast")];
            tensor<fp16, [1, 128, 30, 30]> input_67_cast = add(x = var_228_cast_1, y = var_250_cast)[name = tensor<string, []>("input_67_cast")];
            tensor<int32, [2]> var_257 = const()[name = tensor<string, []>("op_257"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_259 = const()[name = tensor<string, []>("op_259"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_69_pad_type_0 = const()[name = tensor<string, []>("input_69_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_69_pad_0 = const()[name = tensor<string, []>("input_69_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<fp16, [128, 128, 3, 3]> model_model_6_m_1_cv1_conv_weight_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [147456]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(989120))), lut = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1136640))), name = tensor<string, []>("model_model_6_m_1_cv1_conv_weight_to_fp16_palettized"), shape = tensor<uint32, [4]>([128, 128, 3, 3])];
            tensor<fp16, [128]> model_model_6_m_1_cv1_conv_bias_to_fp16 = const()[name = tensor<string, []>("model_model_6_m_1_cv1_conv_bias_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1137216)))];
            tensor<fp16, [1, 128, 30, 30]> input_69_cast = conv(bias = model_model_6_m_1_cv1_conv_bias_to_fp16, dilations = var_259, groups = var_19, pad = input_69_pad_0, pad_type = input_69_pad_type_0, strides = var_257, weight = model_model_6_m_1_cv1_conv_weight_to_fp16_palettized, x = input_67_cast)[name = tensor<string, []>("input_69_cast")];
            tensor<fp16, [1, 128, 30, 30]> input_71_cast = silu(x = input_69_cast)[name = tensor<string, []>("input_71_cast")];
            tensor<int32, [2]> var_266 = const()[name = tensor<string, []>("op_266"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_268 = const()[name = tensor<string, []>("op_268"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_73_pad_type_0 = const()[name = tensor<string, []>("input_73_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_73_pad_0 = const()[name = tensor<string, []>("input_73_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<fp16, [128, 128, 3, 3]> model_model_6_m_1_cv2_conv_weight_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [147456]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1137536))), lut = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1285056))), name = tensor<string, []>("model_model_6_m_1_cv2_conv_weight_to_fp16_palettized"), shape = tensor<uint32, [4]>([128, 128, 3, 3])];
            tensor<fp16, [128]> model_model_6_m_1_cv2_conv_bias_to_fp16 = const()[name = tensor<string, []>("model_model_6_m_1_cv2_conv_bias_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1285632)))];
            tensor<fp16, [1, 128, 30, 30]> input_73_cast = conv(bias = model_model_6_m_1_cv2_conv_bias_to_fp16, dilations = var_268, groups = var_19, pad = input_73_pad_0, pad_type = input_73_pad_type_0, strides = var_266, weight = model_model_6_m_1_cv2_conv_weight_to_fp16_palettized, x = input_71_cast)[name = tensor<string, []>("input_73_cast")];
            tensor<fp16, [1, 128, 30, 30]> var_271_cast = silu(x = input_73_cast)[name = tensor<string, []>("op_271_cast")];
            tensor<fp16, [1, 128, 30, 30]> var_272_cast = add(x = input_67_cast, y = var_271_cast)[name = tensor<string, []>("op_272_cast")];
            tensor<bool, []> input_75_interleave_0 = const()[name = tensor<string, []>("input_75_interleave_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 512, 30, 30]> input_75_cast = concat(axis = var_19, interleave = input_75_interleave_0, values = (var_228_cast_0, var_228_cast_1, input_67_cast, var_272_cast))[name = tensor<string, []>("input_75_cast")];
            tensor<int32, [2]> var_278 = const()[name = tensor<string, []>("op_278"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_280 = const()[name = tensor<string, []>("op_280"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_77_pad_type_0 = const()[name = tensor<string, []>("input_77_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_77_pad_0 = const()[name = tensor<string, []>("input_77_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [256, 512, 1, 1]> model_model_6_cv2_conv_weight_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [131072]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1285952))), lut = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1417088))), name = tensor<string, []>("model_model_6_cv2_conv_weight_to_fp16_palettized"), shape = tensor<uint32, [4]>([256, 512, 1, 1])];
            tensor<fp16, [256]> model_model_6_cv2_conv_bias_to_fp16 = const()[name = tensor<string, []>("model_model_6_cv2_conv_bias_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1417664)))];
            tensor<fp16, [1, 256, 30, 30]> input_77_cast = conv(bias = model_model_6_cv2_conv_bias_to_fp16, dilations = var_280, groups = var_19, pad = input_77_pad_0, pad_type = input_77_pad_type_0, strides = var_278, weight = model_model_6_cv2_conv_weight_to_fp16_palettized, x = input_75_cast)[name = tensor<string, []>("input_77_cast")];
            tensor<fp16, [1, 256, 30, 30]> input_79_cast = silu(x = input_77_cast)[name = tensor<string, []>("input_79_cast")];
            tensor<int32, [2]> var_287 = const()[name = tensor<string, []>("op_287"), val = tensor<int32, [2]>([2, 2])];
            tensor<int32, [2]> var_289 = const()[name = tensor<string, []>("op_289"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_81_pad_type_0 = const()[name = tensor<string, []>("input_81_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_81_pad_0 = const()[name = tensor<string, []>("input_81_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<fp16, [512, 256, 3, 3]> model_model_7_conv_weight_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [1179648]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1418240))), lut = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2597952))), name = tensor<string, []>("model_model_7_conv_weight_to_fp16_palettized"), shape = tensor<uint32, [4]>([512, 256, 3, 3])];
            tensor<fp16, [512]> model_model_7_conv_bias_to_fp16 = const()[name = tensor<string, []>("model_model_7_conv_bias_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2598528)))];
            tensor<fp16, [1, 512, 15, 15]> input_81_cast = conv(bias = model_model_7_conv_bias_to_fp16, dilations = var_289, groups = var_19, pad = input_81_pad_0, pad_type = input_81_pad_type_0, strides = var_287, weight = model_model_7_conv_weight_to_fp16_palettized, x = input_79_cast)[name = tensor<string, []>("input_81_cast")];
            tensor<fp16, [1, 512, 15, 15]> input_83_cast = silu(x = input_81_cast)[name = tensor<string, []>("input_83_cast")];
            tensor<int32, [2]> var_300 = const()[name = tensor<string, []>("op_300"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_302 = const()[name = tensor<string, []>("op_302"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_85_pad_type_0 = const()[name = tensor<string, []>("input_85_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_85_pad_0 = const()[name = tensor<string, []>("input_85_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [512, 512, 1, 1]> model_model_8_cv1_conv_weight_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [262144]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2599616))), lut = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2861824))), name = tensor<string, []>("model_model_8_cv1_conv_weight_to_fp16_palettized"), shape = tensor<uint32, [4]>([512, 512, 1, 1])];
            tensor<fp16, [512]> model_model_8_cv1_conv_bias_to_fp16 = const()[name = tensor<string, []>("model_model_8_cv1_conv_bias_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2862400)))];
            tensor<fp16, [1, 512, 15, 15]> input_85_cast = conv(bias = model_model_8_cv1_conv_bias_to_fp16, dilations = var_302, groups = var_19, pad = input_85_pad_0, pad_type = input_85_pad_type_0, strides = var_300, weight = model_model_8_cv1_conv_weight_to_fp16_palettized, x = input_83_cast)[name = tensor<string, []>("input_85_cast")];
            tensor<fp16, [1, 512, 15, 15]> var_305_cast = silu(x = input_85_cast)[name = tensor<string, []>("op_305_cast")];
            tensor<int32, [2]> var_306 = const()[name = tensor<string, []>("op_306"), val = tensor<int32, [2]>([256, 256])];
            tensor<int32, []> var_307_axis_0 = const()[name = tensor<string, []>("op_307_axis_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [1, 256, 15, 15]> var_307_cast_0, tensor<fp16, [1, 256, 15, 15]> var_307_cast_1 = split(axis = var_307_axis_0, split_sizes = var_306, x = var_305_cast)[name = tensor<string, []>("op_307_cast")];
            tensor<int32, [2]> var_315 = const()[name = tensor<string, []>("op_315"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_317 = const()[name = tensor<string, []>("op_317"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_89_pad_type_0 = const()[name = tensor<string, []>("input_89_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_89_pad_0 = const()[name = tensor<string, []>("input_89_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<fp16, [256, 256, 3, 3]> model_model_8_m_0_cv1_conv_weight_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [589824]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2863488))), lut = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3453376))), name = tensor<string, []>("model_model_8_m_0_cv1_conv_weight_to_fp16_palettized"), shape = tensor<uint32, [4]>([256, 256, 3, 3])];
            tensor<fp16, [256]> model_model_8_m_0_cv1_conv_bias_to_fp16 = const()[name = tensor<string, []>("model_model_8_m_0_cv1_conv_bias_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3453952)))];
            tensor<fp16, [1, 256, 15, 15]> input_89_cast = conv(bias = model_model_8_m_0_cv1_conv_bias_to_fp16, dilations = var_317, groups = var_19, pad = input_89_pad_0, pad_type = input_89_pad_type_0, strides = var_315, weight = model_model_8_m_0_cv1_conv_weight_to_fp16_palettized, x = var_307_cast_1)[name = tensor<string, []>("input_89_cast")];
            tensor<fp16, [1, 256, 15, 15]> input_91_cast = silu(x = input_89_cast)[name = tensor<string, []>("input_91_cast")];
            tensor<int32, [2]> var_324 = const()[name = tensor<string, []>("op_324"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_326 = const()[name = tensor<string, []>("op_326"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_93_pad_type_0 = const()[name = tensor<string, []>("input_93_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_93_pad_0 = const()[name = tensor<string, []>("input_93_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<fp16, [256, 256, 3, 3]> model_model_8_m_0_cv2_conv_weight_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [589824]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3454528))), lut = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(4044416))), name = tensor<string, []>("model_model_8_m_0_cv2_conv_weight_to_fp16_palettized"), shape = tensor<uint32, [4]>([256, 256, 3, 3])];
            tensor<fp16, [256]> model_model_8_m_0_cv2_conv_bias_to_fp16 = const()[name = tensor<string, []>("model_model_8_m_0_cv2_conv_bias_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(4044992)))];
            tensor<fp16, [1, 256, 15, 15]> input_93_cast = conv(bias = model_model_8_m_0_cv2_conv_bias_to_fp16, dilations = var_326, groups = var_19, pad = input_93_pad_0, pad_type = input_93_pad_type_0, strides = var_324, weight = model_model_8_m_0_cv2_conv_weight_to_fp16_palettized, x = input_91_cast)[name = tensor<string, []>("input_93_cast")];
            tensor<fp16, [1, 256, 15, 15]> var_329_cast = silu(x = input_93_cast)[name = tensor<string, []>("op_329_cast")];
            tensor<fp16, [1, 256, 15, 15]> var_330_cast = add(x = var_307_cast_1, y = var_329_cast)[name = tensor<string, []>("op_330_cast")];
            tensor<bool, []> input_95_interleave_0 = const()[name = tensor<string, []>("input_95_interleave_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 768, 15, 15]> input_95_cast = concat(axis = var_19, interleave = input_95_interleave_0, values = (var_307_cast_0, var_307_cast_1, var_330_cast))[name = tensor<string, []>("input_95_cast")];
            tensor<int32, [2]> var_336 = const()[name = tensor<string, []>("op_336"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_338 = const()[name = tensor<string, []>("op_338"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_97_pad_type_0 = const()[name = tensor<string, []>("input_97_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_97_pad_0 = const()[name = tensor<string, []>("input_97_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [512, 768, 1, 1]> model_model_8_cv2_conv_weight_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [393216]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(4045568))), lut = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(4438848))), name = tensor<string, []>("model_model_8_cv2_conv_weight_to_fp16_palettized"), shape = tensor<uint32, [4]>([512, 768, 1, 1])];
            tensor<fp16, [512]> model_model_8_cv2_conv_bias_to_fp16 = const()[name = tensor<string, []>("model_model_8_cv2_conv_bias_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(4439424)))];
