<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>files</key>
	<dict>
		<key>Assets.car</key>
		<data>
		Uezf8uQ3/0vCUJsLpyU2Fb62iE8=
		</data>
		<key>ConfirmViewController.nib</key>
		<data>
		kzwutsl9dHKVmuhLGtht465oE50=
		</data>
		<key>GuideVC.nib</key>
		<data>
		9CSG283ZRxb3wf3CxyotWfOXXYE=
		</data>
		<key>Headers/KLPCrypto.h</key>
		<data>
		XUrwRTJCzYLxghYTpSMTcf+xMIs=
		</data>
		<key>Headers/KalapaSDK-Swift.h</key>
		<data>
		GiAszA2g2u+qg4Na7YM57hkT1M4=
		</data>
		<key>Headers/KalapaSDK.h</key>
		<data>
		lwPTOcE/lWkKvyHblQbbkDEHvXE=
		</data>
		<key>IDCaptureVC.nib</key>
		<data>
		UJDrl2uBvv7KpAi9BmkzD1hUefI=
		</data>
		<key>Info.plist</key>
		<data>
		vTztHB8oQkxM9KQFUO5ZriRheNc=
		</data>
		<key>InforCell.nib</key>
		<data>
		yxwDApZc8mJGRv2Nccy/KeHo5sA=
		</data>
		<key>KLPAlertVC.nib</key>
		<data>
		pGnViWPvOEz2g8g6SLpdaSpiI2s=
		</data>
		<key>KLPFaceVC.nib</key>
		<data>
		rvtgabhUyFismYszKq3MfAfDqZA=
		</data>
		<key>KLPNFCAntennaVC.nib</key>
		<data>
		XKtgUGdP1PqZPUvsbvi6hxFecRY=
		</data>
		<key>KLPPopupHolderViewController.nib</key>
		<data>
		IkCzwTSnMQZP1G/mthDvuYZNTfA=
		</data>
		<key>KLPResultNFCVC.nib</key>
		<data>
		SlT/t4yImlRpo4CmQ6SSk9LraSc=
		</data>
		<key>KLPResulteKYCVC.nib</key>
		<data>
		1HU0+YXDyQT4twMbT3kCiB7gdNY=
		</data>
		<key>KLPScanNFCVC.nib</key>
		<data>
		OuBXFvNsizOhUvgv7jdA9bk+Cro=
		</data>
		<key>Main.storyboardc/Info.plist</key>
		<data>
		GnMdGFfDuvwAuWJN7FS9ELLozY4=
		</data>
		<key>Modules/KalapaSDK.swiftmodule/arm64-apple-ios-simulator.abi.json</key>
		<data>
		a4LCUfzg1Sut0hwf6g5WQNNEZHQ=
		</data>
		<key>Modules/KalapaSDK.swiftmodule/arm64-apple-ios-simulator.private.swiftinterface</key>
		<data>
		KtV1kkZdzz+0ISGnwrRZ0sKCXZ4=
		</data>
		<key>Modules/KalapaSDK.swiftmodule/arm64-apple-ios-simulator.swiftdoc</key>
		<data>
		iR28P3eM5+I5Z9MSrOnZmfQ2OMk=
		</data>
		<key>Modules/KalapaSDK.swiftmodule/arm64-apple-ios-simulator.swiftinterface</key>
		<data>
		KtV1kkZdzz+0ISGnwrRZ0sKCXZ4=
		</data>
		<key>Modules/KalapaSDK.swiftmodule/arm64-apple-ios-simulator.swiftmodule</key>
		<data>
		51/b1/2vrVlJeXRt86kyTmZDxoY=
		</data>
		<key>Modules/KalapaSDK.swiftmodule/x86_64-apple-ios-simulator.abi.json</key>
		<data>
		a4LCUfzg1Sut0hwf6g5WQNNEZHQ=
		</data>
		<key>Modules/KalapaSDK.swiftmodule/x86_64-apple-ios-simulator.private.swiftinterface</key>
		<data>
		SGcPKseGBuw1ZnZV945btd5POec=
		</data>
		<key>Modules/KalapaSDK.swiftmodule/x86_64-apple-ios-simulator.swiftdoc</key>
		<data>
		K72JwX454euhB2tPKzB7LUE56mo=
		</data>
		<key>Modules/KalapaSDK.swiftmodule/x86_64-apple-ios-simulator.swiftinterface</key>
		<data>
		SGcPKseGBuw1ZnZV945btd5POec=
		</data>
		<key>Modules/KalapaSDK.swiftmodule/x86_64-apple-ios-simulator.swiftmodule</key>
		<data>
		PybhWYJinTWdH6sFXOAp6nPRQxE=
		</data>
		<key>Modules/module.modulemap</key>
		<data>
		s3VxFhfotv8PN3YxO49/NQBqW/E=
		</data>
		<key>TutorialButtonView.nib</key>
		<data>
		FTvPH3JlRQmxNOa/Mu/VMq3qU38=
		</data>
		<key>flashcard.mlmodelc/analytics/coremldata.bin</key>
		<data>
		c3drmztbQzdZTXZ5xJVZJbKyuCs=
		</data>
		<key>flashcard.mlmodelc/coremldata.bin</key>
		<data>
		IFNnX3lk6HePuEZLGIQlj/1I8ZA=
		</data>
		<key>flashcard.mlmodelc/metadata.json</key>
		<data>
		JzumqWhS8FDjXSqqWZyNprfwPg4=
		</data>
		<key>flashcard.mlmodelc/model0/analytics/coremldata.bin</key>
		<data>
		24ppOAHUtsiCiVrf6FodQrXXc8M=
		</data>
		<key>flashcard.mlmodelc/model0/coremldata.bin</key>
		<data>
		J7JOYf2Rsjsq5uJP8gau7WbeIbE=
		</data>
		<key>flashcard.mlmodelc/model0/model.mil</key>
		<data>
		l66QWnx2oqdBBJfCXgCRLcwuneU=
		</data>
		<key>flashcard.mlmodelc/model0/weights/weight.bin</key>
		<data>
		hxz25NVqqe1k+DLhSJakF7kvPyI=
		</data>
		<key>flashcard.mlmodelc/model1/coremldata.bin</key>
		<data>
		ZtIuuGbhSH6425Cd2GqlYpTy0lw=
		</data>
		<key>idcard.mlmodelc/analytics/coremldata.bin</key>
		<data>
		d42KVSZ0j/oBQXong1QYfCA4ssA=
		</data>
		<key>idcard.mlmodelc/coremldata.bin</key>
		<data>
		Cjfd6u9CoXXv2TYpJqdJkEHrNR0=
		</data>
		<key>idcard.mlmodelc/metadata.json</key>
		<data>
		03IZrNFxrRD+6fg2jEPKCtHXO9o=
		</data>
		<key>idcard.mlmodelc/model0/analytics/coremldata.bin</key>
		<data>
		WYcyKG2C4JOdNowOu12fq5T9sdo=
		</data>
		<key>idcard.mlmodelc/model0/coremldata.bin</key>
		<data>
		dKnbsVdWFgKSP5VPi9iLPjjreZk=
		</data>
		<key>idcard.mlmodelc/model0/model.espresso.net</key>
		<data>
		/IwLpI2cK+wRbXYdp0LtafFuiIY=
		</data>
		<key>idcard.mlmodelc/model0/model.espresso.shape</key>
		<data>
		3S+oLuYW2Bk25/lT8gwPL4uiavo=
		</data>
		<key>idcard.mlmodelc/model0/model.espresso.weights</key>
		<data>
		Txy0xE+202q6KHAZKa5YEozOSV8=
		</data>
		<key>idcard.mlmodelc/model0/model/coremldata.bin</key>
		<data>
		tGU7K8v0jbmLrWPOZkDsl7EBsZk=
		</data>
		<key>idcard.mlmodelc/model0/neural_network_optionals/coremldata.bin</key>
		<data>
		tkgF5pxT7RlO+9uypQti9obolyA=
		</data>
		<key>idcard.mlmodelc/model1/coremldata.bin</key>
		<data>
		NXxIiW4XQUGbpyD4n+G6aqXqmfc=
		</data>
		<key>tiltLeft.gif</key>
		<data>
		wgxl2AXcXNeBb/VtevkzTAK6i3c=
		</data>
		<key>tiltRight.gif</key>
		<data>
		gFC1WdjBQ+ghN1YtZX9jVpQA/Kg=
		</data>
		<key>turnDown.gif</key>
		<data>
		art7RAKEBWKS5fnzgchKgyaBvrU=
		</data>
		<key>turnLeft.gif</key>
		<data>
		lDkcUnZVN7TFM1NNOwtYjeOZN/Y=
		</data>
		<key>turnRight.gif</key>
		<data>
		Li/bbwbAGvy1Lm9wo7xomqKKsG4=
		</data>
		<key>turnUp.gif</key>
		<data>
		d4TJTbNzdhMseX8WZjQO/4UK6co=
		</data>
	</dict>
	<key>files2</key>
	<dict>
		<key>Assets.car</key>
		<dict>
			<key>hash2</key>
			<data>
			EwKoYNuFmsTdHUBRKYM/lPoMvk5CunugqlKXFUAT7N8=
			</data>
		</dict>
		<key>ConfirmViewController.nib</key>
		<dict>
			<key>hash2</key>
			<data>
			O3cfxiTpm6WgEXfAH/zbFSUX5YixDm3v8Wd1WILrijY=
			</data>
		</dict>
		<key>GuideVC.nib</key>
		<dict>
			<key>hash2</key>
			<data>
			fc5PCwLzAP2FzFrHWFxxhuzyBj9oZnyZzcWXd889yJQ=
			</data>
		</dict>
		<key>Headers/KLPCrypto.h</key>
		<dict>
			<key>hash2</key>
			<data>
			OjcI1EV7AQAjlYcK2Au3Mt4tX9sePyVv+FRbssZvW2M=
			</data>
		</dict>
		<key>Headers/KalapaSDK-Swift.h</key>
		<dict>
			<key>hash2</key>
			<data>
			OKLzelSnme0hX0RdB59ZIlsnIkzw6uZMDkqoI1FvF0U=
			</data>
		</dict>
		<key>Headers/KalapaSDK.h</key>
		<dict>
			<key>hash2</key>
			<data>
			GgfhfYkPeq59WdS4mWuW77zg1JcFCN55r5D8TD7eLfM=
			</data>
		</dict>
		<key>IDCaptureVC.nib</key>
		<dict>
			<key>hash2</key>
			<data>
			p0zmbXjliKw7R9aBxwe8DWKhwyKWIOUlgzkUrxYoRdw=
			</data>
		</dict>
		<key>InforCell.nib</key>
		<dict>
			<key>hash2</key>
			<data>
			e1zEWU1qeiXcQAm91HtVtbXIgSxGPxRvTl/aWV18/vY=
			</data>
		</dict>
		<key>KLPAlertVC.nib</key>
		<dict>
			<key>hash2</key>
			<data>
			aYn+fi75tMsS1GEmkr+kN1LuZEI8DLsN9HIYJFmUrUE=
			</data>
		</dict>
		<key>KLPFaceVC.nib</key>
		<dict>
			<key>hash2</key>
			<data>
			chxKwYu2f0RIwvnuewfTn1kd1Nd58soitGKJAuOXagc=
			</data>
		</dict>
		<key>KLPNFCAntennaVC.nib</key>
		<dict>
			<key>hash2</key>
			<data>
			in9kft9IPNi2zzNXnOqk2Ha/WNHweJZngSemmqp24IM=
			</data>
		</dict>
		<key>KLPPopupHolderViewController.nib</key>
		<dict>
			<key>hash2</key>
			<data>
			ovnJnlQBX4sLDjuSmVFKzfYI4N+AwZ4IZm2yrqOv4wA=
			</data>
		</dict>
		<key>KLPResultNFCVC.nib</key>
		<dict>
			<key>hash2</key>
			<data>
			ZzzZfo4EL9fK2zwdB67iZY62KploHpdXPD17IFNqebM=
			</data>
		</dict>
		<key>KLPResulteKYCVC.nib</key>
		<dict>
			<key>hash2</key>
			<data>
			0vyHeKFc63nI1jTPzr651qDyKK9qRAcibTdlG0+g4zI=
			</data>
		</dict>
		<key>KLPScanNFCVC.nib</key>
		<dict>
			<key>hash2</key>
			<data>
			gN6DFDiqwrV23JeH5sr2W2dqoGIiy2ZNA1oiHKBF7LU=
			</data>
		</dict>
		<key>Main.storyboardc/Info.plist</key>
		<dict>
			<key>hash2</key>
			<data>
			9gq+m2SfIqZdO4RnP+Q5bwx0h1nftPpvwkJZZ8jBiZE=
			</data>
		</dict>
		<key>Modules/KalapaSDK.swiftmodule/arm64-apple-ios-simulator.abi.json</key>
		<dict>
			<key>hash2</key>
			<data>
			pgIsXn4wr43z7YqMJ7M12dVja8fVzKJW1zxrDkUP8+A=
			</data>
		</dict>
		<key>Modules/KalapaSDK.swiftmodule/arm64-apple-ios-simulator.private.swiftinterface</key>
		<dict>
			<key>hash2</key>
			<data>
			QVBW2aoWA6IbR8kM6r5uvv3xqTwWLkigGIMbyAwQ+Js=
			</data>
		</dict>
		<key>Modules/KalapaSDK.swiftmodule/arm64-apple-ios-simulator.swiftdoc</key>
		<dict>
			<key>hash2</key>
			<data>
			kL9f/R/S41ImXdpTNVtZlmkCFRspRFa859VnDQOtRYw=
			</data>
		</dict>
		<key>Modules/KalapaSDK.swiftmodule/arm64-apple-ios-simulator.swiftinterface</key>
		<dict>
			<key>hash2</key>
			<data>
			QVBW2aoWA6IbR8kM6r5uvv3xqTwWLkigGIMbyAwQ+Js=
			</data>
		</dict>
		<key>Modules/KalapaSDK.swiftmodule/arm64-apple-ios-simulator.swiftmodule</key>
		<dict>
			<key>hash2</key>
			<data>
			9I7cTJ4L8aJDl0pjNzwdB3OkaC+ITVQpCvlLMe4WNtY=
			</data>
		</dict>
		<key>Modules/KalapaSDK.swiftmodule/x86_64-apple-ios-simulator.abi.json</key>
		<dict>
			<key>hash2</key>
			<data>
			pgIsXn4wr43z7YqMJ7M12dVja8fVzKJW1zxrDkUP8+A=
			</data>
		</dict>
		<key>Modules/KalapaSDK.swiftmodule/x86_64-apple-ios-simulator.private.swiftinterface</key>
		<dict>
			<key>hash2</key>
			<data>
			Bk2AamzTrHylr7m2YmnjmtNNQheJl6QlmEhzL8oOs9M=
			</data>
		</dict>
		<key>Modules/KalapaSDK.swiftmodule/x86_64-apple-ios-simulator.swiftdoc</key>
		<dict>
			<key>hash2</key>
			<data>
			WSOjYEPguN/BEuXUXy83+7cPsxZzJuLD/dXbFoFSl1A=
			</data>
		</dict>
		<key>Modules/KalapaSDK.swiftmodule/x86_64-apple-ios-simulator.swiftinterface</key>
		<dict>
			<key>hash2</key>
			<data>
			Bk2AamzTrHylr7m2YmnjmtNNQheJl6QlmEhzL8oOs9M=
			</data>
		</dict>
		<key>Modules/KalapaSDK.swiftmodule/x86_64-apple-ios-simulator.swiftmodule</key>
		<dict>
			<key>hash2</key>
			<data>
			MQKOaiqGON3Eh0hircOgKhu3lVQh2+/0wyakIN5xjzY=
			</data>
		</dict>
		<key>Modules/module.modulemap</key>
		<dict>
			<key>hash2</key>
			<data>
			+FjPbCJaSA4BTqRUcN5veFP8ReWKA36wbs5YfD1BcUE=
			</data>
		</dict>
		<key>TutorialButtonView.nib</key>
		<dict>
			<key>hash2</key>
			<data>
			NHpU1Ds5a0tupQMwkqsLyp+6VrFwrf5TYUUc4q4jDaM=
			</data>
		</dict>
		<key>flashcard.mlmodelc/analytics/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			EyniSMkt4awMGKCAcvzDPKL1gj3gyZiCJ095xaZMwVw=
			</data>
		</dict>
		<key>flashcard.mlmodelc/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			+izE7rXTjVjSBAxLz81YCEo8ynLGlGLffiS5lwVpCPw=
			</data>
		</dict>
		<key>flashcard.mlmodelc/metadata.json</key>
		<dict>
			<key>hash2</key>
			<data>
			phr/txtoMGKzrIjjCqK70dNKInpy5vbDG4yLOLlWVlA=
			</data>
		</dict>
		<key>flashcard.mlmodelc/model0/analytics/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			WoKBBJsqZaO+VBz9n5SehLj+HFJRzpDkbaFib+1U5Yo=
			</data>
		</dict>
		<key>flashcard.mlmodelc/model0/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			7IYbkKESZqXFDmeOhsGyPymFVKAS8CkJ24cdEtWYbhE=
			</data>
		</dict>
		<key>flashcard.mlmodelc/model0/model.mil</key>
		<dict>
			<key>hash2</key>
			<data>
			bjajqTOpMs2ffLWMj364hAcq6V6qGSfhDb4F3WI1UNU=
			</data>
		</dict>
		<key>flashcard.mlmodelc/model0/weights/weight.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			P8YmBHKtUbOJ7RPMrhPZcVIfG+mtTawdOmdAVvFLf7s=
			</data>
		</dict>
		<key>flashcard.mlmodelc/model1/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			MkLY6cZlBHGUwQcm8E60ELuEDQwLJdGs5wVDYoQlSeo=
			</data>
		</dict>
		<key>idcard.mlmodelc/analytics/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			a8hzYLAAZy1QHu4psOHw2uQO2hBK8+R8Qrf3G1LR1G4=
			</data>
		</dict>
		<key>idcard.mlmodelc/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			gpIZb81sJxgTRyTwUdMQM29zCLtcsWW+Y9lkiifZi7Q=
			</data>
		</dict>
		<key>idcard.mlmodelc/metadata.json</key>
		<dict>
			<key>hash2</key>
			<data>
			ge2U1oehefMbywDVVSqmxDE2FzKlIPlOnrTy1/s1yQI=
			</data>
		</dict>
		<key>idcard.mlmodelc/model0/analytics/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			zvv0UByXamWTe/kJ32E7S90UrHff7P+WVG4UOg8JdjE=
			</data>
		</dict>
		<key>idcard.mlmodelc/model0/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			TFYLeGdykl6AQNGQPKEthrTwwsUCCLM2ZrMDo1rJa6w=
			</data>
		</dict>
		<key>idcard.mlmodelc/model0/model.espresso.net</key>
		<dict>
			<key>hash2</key>
			<data>
			Vxi/PBbn0+SiTn+OYs1XobWUPZ3FAqUjYKKSrgmk7x8=
			</data>
		</dict>
		<key>idcard.mlmodelc/model0/model.espresso.shape</key>
		<dict>
			<key>hash2</key>
			<data>
			qNNnurL/iwWigYiCwM4S21XZr009v56Bcc+W8SaZxZw=
			</data>
		</dict>
		<key>idcard.mlmodelc/model0/model.espresso.weights</key>
		<dict>
			<key>hash2</key>
			<data>
			tFSPccGRF2y0WDYFuVWpijXwhQfDXjEVFmpSUa0IfuE=
			</data>
		</dict>
		<key>idcard.mlmodelc/model0/model/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			JsMfzXP3J1PCXEF2nqub8rHW9vXpXkr2ag9c2kxRcE8=
			</data>
		</dict>
		<key>idcard.mlmodelc/model0/neural_network_optionals/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			WTG9U2xFUClKISxvyNPBvuddqBeYC6C2cchgPa+zYjg=
			</data>
		</dict>
		<key>idcard.mlmodelc/model1/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			A053yveiwgh35xO5xxMbw74hiQPfQeH7lDuTj57GSdM=
			</data>
		</dict>
		<key>tiltLeft.gif</key>
		<dict>
			<key>hash2</key>
			<data>
			2BaFWI8IB2ZhKEbKBIeHN+UX7MkGUFaBHFXhQqkoapE=
			</data>
		</dict>
		<key>tiltRight.gif</key>
		<dict>
			<key>hash2</key>
			<data>
			DglqXZpGBjKJC22GjVnQJFpnvAmL6Nf44TERpi5A5TE=
			</data>
		</dict>
		<key>turnDown.gif</key>
		<dict>
			<key>hash2</key>
			<data>
			U+Se1wtaiFMN+6SJ9pgKvV8BNHwOgeXlh3c9wbPpq0w=
			</data>
		</dict>
		<key>turnLeft.gif</key>
		<dict>
			<key>hash2</key>
			<data>
			gyAbiyHNANmjsj95deuKVYSlABPKOwcAgo58AlJzZIU=
			</data>
		</dict>
		<key>turnRight.gif</key>
		<dict>
			<key>hash2</key>
			<data>
			H82bISUHIhph3Zr885toAu6BfUJJuUbxhQek1hSXlnA=
			</data>
		</dict>
		<key>turnUp.gif</key>
		<dict>
			<key>hash2</key>
			<data>
			lZ8IBYGvv5Xqs2j9g/tXuaXTPPRYN2wSOfjHrJXcAjo=
			</data>
		</dict>
	</dict>
	<key>rules</key>
	<dict>
		<key>^.*</key>
		<true/>
		<key>^.*\.lproj/</key>
		<dict>
			<key>optional</key>
			<true/>
			<key>weight</key>
			<real>1000</real>
		</dict>
		<key>^.*\.lproj/locversion.plist$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>1100</real>
		</dict>
		<key>^Base\.lproj/</key>
		<dict>
			<key>weight</key>
			<real>1010</real>
		</dict>
		<key>^version.plist$</key>
		<true/>
	</dict>
	<key>rules2</key>
	<dict>
		<key>.*\.dSYM($|/)</key>
		<dict>
			<key>weight</key>
			<real>11</real>
		</dict>
		<key>^(.*/)?\.DS_Store$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>2000</real>
		</dict>
		<key>^.*</key>
		<true/>
		<key>^.*\.lproj/</key>
		<dict>
			<key>optional</key>
			<true/>
			<key>weight</key>
			<real>1000</real>
		</dict>
		<key>^.*\.lproj/locversion.plist$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>1100</real>
		</dict>
		<key>^Base\.lproj/</key>
		<dict>
			<key>weight</key>
			<real>1010</real>
		</dict>
		<key>^Info\.plist$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>20</real>
		</dict>
		<key>^PkgInfo$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>20</real>
		</dict>
		<key>^embedded\.provisionprofile$</key>
		<dict>
			<key>weight</key>
			<real>20</real>
		</dict>
		<key>^version\.plist$</key>
		<dict>
			<key>weight</key>
			<real>20</real>
		</dict>
	</dict>
</dict>
</plist>
